# Заполните массив элементами арифметической прогрессии.
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры.
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.

first_item = int(input('Введите первый элемент: '))
diff = int(input('Введите разность: '))
amount = int(input('Введите количество элементов: '))
array = []

for i in range(amount):
    array.append(first_item + diff * i)

print(f'Результат заполнения массива: {array}')